RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/osd_draw_h_reg.h
/**
  ******************************************************************************
  * @file    osd_draw_h_reg.h
  * @version V1.0
  * @date    2021-06-28
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __OSD_DRAW_H_REG_H__
#define __OSD_DRAW_H_REG_H__

#include "bl808.h"

/* 0x4 : draw_partial_config */
#define OSD_DRAW_H_DRAW_PARTIAL_CONFIG_OFFSET (0x4)
#define OSD_DRAW_H_REG_DRAW_EN_H              OSD_DRAW_H_REG_DRAW_EN_H
#define OSD_DRAW_H_REG_DRAW_EN_H_POS          (0U)
#define OSD_DRAW_H_REG_DRAW_EN_H_LEN          (16U)
#define OSD_DRAW_H_REG_DRAW_EN_H_MSK          (((1U << OSD_DRAW_H_REG_DRAW_EN_H_LEN) - 1) << OSD_DRAW_H_REG_DRAW_EN_H_POS)
#define OSD_DRAW_H_REG_DRAW_EN_H_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_EN_H_LEN) - 1) << OSD_DRAW_H_REG_DRAW_EN_H_POS))
#define OSD_DRAW_H_REG_DRAW_TYPE_H            OSD_DRAW_H_REG_DRAW_TYPE_H
#define OSD_DRAW_H_REG_DRAW_TYPE_H_POS        (16U)
#define OSD_DRAW_H_REG_DRAW_TYPE_H_LEN        (16U)
#define OSD_DRAW_H_REG_DRAW_TYPE_H_MSK        (((1U << OSD_DRAW_H_REG_DRAW_TYPE_H_LEN) - 1) << OSD_DRAW_H_REG_DRAW_TYPE_H_POS)
#define OSD_DRAW_H_REG_DRAW_TYPE_H_UMSK       (~(((1U << OSD_DRAW_H_REG_DRAW_TYPE_H_LEN) - 1) << OSD_DRAW_H_REG_DRAW_TYPE_H_POS))

/* 0x8 : draw_partial_yuv_config10 */
#define OSD_DRAW_H_DRAW_PARTIAL_YUV_CONFIG10_OFFSET (0x8)
#define OSD_DRAW_H_REG_DRAW_TH_10                   OSD_DRAW_H_REG_DRAW_TH_10
#define OSD_DRAW_H_REG_DRAW_TH_10_POS               (0U)
#define OSD_DRAW_H_REG_DRAW_TH_10_LEN               (8U)
#define OSD_DRAW_H_REG_DRAW_TH_10_MSK               (((1U << OSD_DRAW_H_REG_DRAW_TH_10_LEN) - 1) << OSD_DRAW_H_REG_DRAW_TH_10_POS)
#define OSD_DRAW_H_REG_DRAW_TH_10_UMSK              (~(((1U << OSD_DRAW_H_REG_DRAW_TH_10_LEN) - 1) << OSD_DRAW_H_REG_DRAW_TH_10_POS))
#define OSD_DRAW_H_REG_DRAW_V_10                    OSD_DRAW_H_REG_DRAW_V_10
#define OSD_DRAW_H_REG_DRAW_V_10_POS                (8U)
#define OSD_DRAW_H_REG_DRAW_V_10_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_V_10_MSK                (((1U << OSD_DRAW_H_REG_DRAW_V_10_LEN) - 1) << OSD_DRAW_H_REG_DRAW_V_10_POS)
#define OSD_DRAW_H_REG_DRAW_V_10_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_V_10_LEN) - 1) << OSD_DRAW_H_REG_DRAW_V_10_POS))
#define OSD_DRAW_H_REG_DRAW_U_10                    OSD_DRAW_H_REG_DRAW_U_10
#define OSD_DRAW_H_REG_DRAW_U_10_POS                (16U)
#define OSD_DRAW_H_REG_DRAW_U_10_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_U_10_MSK                (((1U << OSD_DRAW_H_REG_DRAW_U_10_LEN) - 1) << OSD_DRAW_H_REG_DRAW_U_10_POS)
#define OSD_DRAW_H_REG_DRAW_U_10_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_U_10_LEN) - 1) << OSD_DRAW_H_REG_DRAW_U_10_POS))
#define OSD_DRAW_H_REG_DRAW_Y_10                    OSD_DRAW_H_REG_DRAW_Y_10
#define OSD_DRAW_H_REG_DRAW_Y_10_POS                (24U)
#define OSD_DRAW_H_REG_DRAW_Y_10_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_Y_10_MSK                (((1U << OSD_DRAW_H_REG_DRAW_Y_10_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_10_POS)
#define OSD_DRAW_H_REG_DRAW_Y_10_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_Y_10_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_10_POS))

/* 0xC : draw_partial_x_config10 */
#define OSD_DRAW_H_DRAW_PARTIAL_X_CONFIG10_OFFSET (0xC)
#define OSD_DRAW_H_REG_DRAW_X_MIN_10              OSD_DRAW_H_REG_DRAW_X_MIN_10
#define OSD_DRAW_H_REG_DRAW_X_MIN_10_POS          (0U)
#define OSD_DRAW_H_REG_DRAW_X_MIN_10_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_X_MIN_10_MSK          (((1U << OSD_DRAW_H_REG_DRAW_X_MIN_10_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MIN_10_POS)
#define OSD_DRAW_H_REG_DRAW_X_MIN_10_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_X_MIN_10_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MIN_10_POS))
#define OSD_DRAW_H_REG_DRAW_X_MAX_10              OSD_DRAW_H_REG_DRAW_X_MAX_10
#define OSD_DRAW_H_REG_DRAW_X_MAX_10_POS          (16U)
#define OSD_DRAW_H_REG_DRAW_X_MAX_10_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_X_MAX_10_MSK          (((1U << OSD_DRAW_H_REG_DRAW_X_MAX_10_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MAX_10_POS)
#define OSD_DRAW_H_REG_DRAW_X_MAX_10_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_X_MAX_10_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MAX_10_POS))

/* 0x10 : draw_partial_y_config10 */
#define OSD_DRAW_H_DRAW_PARTIAL_Y_CONFIG10_OFFSET (0x10)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_10              OSD_DRAW_H_REG_DRAW_Y_MIN_10
#define OSD_DRAW_H_REG_DRAW_Y_MIN_10_POS          (0U)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_10_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_10_MSK          (((1U << OSD_DRAW_H_REG_DRAW_Y_MIN_10_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MIN_10_POS)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_10_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_Y_MIN_10_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MIN_10_POS))
#define OSD_DRAW_H_REG_DRAW_Y_MAX_10              OSD_DRAW_H_REG_DRAW_Y_MAX_10
#define OSD_DRAW_H_REG_DRAW_Y_MAX_10_POS          (16U)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_10_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_10_MSK          (((1U << OSD_DRAW_H_REG_DRAW_Y_MAX_10_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MAX_10_POS)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_10_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_Y_MAX_10_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MAX_10_POS))

