RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/osd_draw_h_reg.h
/* 0x14 : draw_partial_yuv_config11 */
#define OSD_DRAW_H_DRAW_PARTIAL_YUV_CONFIG11_OFFSET (0x14)
#define OSD_DRAW_H_REG_DRAW_TH_11                   OSD_DRAW_H_REG_DRAW_TH_11
#define OSD_DRAW_H_REG_DRAW_TH_11_POS               (0U)
#define OSD_DRAW_H_REG_DRAW_TH_11_LEN               (8U)
#define OSD_DRAW_H_REG_DRAW_TH_11_MSK               (((1U << OSD_DRAW_H_REG_DRAW_TH_11_LEN) - 1) << OSD_DRAW_H_REG_DRAW_TH_11_POS)
#define OSD_DRAW_H_REG_DRAW_TH_11_UMSK              (~(((1U << OSD_DRAW_H_REG_DRAW_TH_11_LEN) - 1) << OSD_DRAW_H_REG_DRAW_TH_11_POS))
#define OSD_DRAW_H_REG_DRAW_V_11                    OSD_DRAW_H_REG_DRAW_V_11
#define OSD_DRAW_H_REG_DRAW_V_11_POS                (8U)
#define OSD_DRAW_H_REG_DRAW_V_11_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_V_11_MSK                (((1U << OSD_DRAW_H_REG_DRAW_V_11_LEN) - 1) << OSD_DRAW_H_REG_DRAW_V_11_POS)
#define OSD_DRAW_H_REG_DRAW_V_11_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_V_11_LEN) - 1) << OSD_DRAW_H_REG_DRAW_V_11_POS))
#define OSD_DRAW_H_REG_DRAW_U_11                    OSD_DRAW_H_REG_DRAW_U_11
#define OSD_DRAW_H_REG_DRAW_U_11_POS                (16U)
#define OSD_DRAW_H_REG_DRAW_U_11_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_U_11_MSK                (((1U << OSD_DRAW_H_REG_DRAW_U_11_LEN) - 1) << OSD_DRAW_H_REG_DRAW_U_11_POS)
#define OSD_DRAW_H_REG_DRAW_U_11_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_U_11_LEN) - 1) << OSD_DRAW_H_REG_DRAW_U_11_POS))
#define OSD_DRAW_H_REG_DRAW_Y_11                    OSD_DRAW_H_REG_DRAW_Y_11
#define OSD_DRAW_H_REG_DRAW_Y_11_POS                (24U)
#define OSD_DRAW_H_REG_DRAW_Y_11_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_Y_11_MSK                (((1U << OSD_DRAW_H_REG_DRAW_Y_11_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_11_POS)
#define OSD_DRAW_H_REG_DRAW_Y_11_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_Y_11_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_11_POS))

/* 0x18 : draw_partial_x_config11 */
#define OSD_DRAW_H_DRAW_PARTIAL_X_CONFIG11_OFFSET (0x18)
#define OSD_DRAW_H_REG_DRAW_X_MIN_11              OSD_DRAW_H_REG_DRAW_X_MIN_11
#define OSD_DRAW_H_REG_DRAW_X_MIN_11_POS          (0U)
#define OSD_DRAW_H_REG_DRAW_X_MIN_11_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_X_MIN_11_MSK          (((1U << OSD_DRAW_H_REG_DRAW_X_MIN_11_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MIN_11_POS)
#define OSD_DRAW_H_REG_DRAW_X_MIN_11_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_X_MIN_11_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MIN_11_POS))
#define OSD_DRAW_H_REG_DRAW_X_MAX_11              OSD_DRAW_H_REG_DRAW_X_MAX_11
#define OSD_DRAW_H_REG_DRAW_X_MAX_11_POS          (16U)
#define OSD_DRAW_H_REG_DRAW_X_MAX_11_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_X_MAX_11_MSK          (((1U << OSD_DRAW_H_REG_DRAW_X_MAX_11_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MAX_11_POS)
#define OSD_DRAW_H_REG_DRAW_X_MAX_11_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_X_MAX_11_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MAX_11_POS))

/* 0x1C : draw_partial_y_config11 */
#define OSD_DRAW_H_DRAW_PARTIAL_Y_CONFIG11_OFFSET (0x1C)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_11              OSD_DRAW_H_REG_DRAW_Y_MIN_11
#define OSD_DRAW_H_REG_DRAW_Y_MIN_11_POS          (0U)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_11_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_11_MSK          (((1U << OSD_DRAW_H_REG_DRAW_Y_MIN_11_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MIN_11_POS)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_11_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_Y_MIN_11_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MIN_11_POS))
#define OSD_DRAW_H_REG_DRAW_Y_MAX_11              OSD_DRAW_H_REG_DRAW_Y_MAX_11
#define OSD_DRAW_H_REG_DRAW_Y_MAX_11_POS          (16U)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_11_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_11_MSK          (((1U << OSD_DRAW_H_REG_DRAW_Y_MAX_11_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MAX_11_POS)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_11_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_Y_MAX_11_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MAX_11_POS))

/* 0x20 : draw_partial_yuv_config12 */
#define OSD_DRAW_H_DRAW_PARTIAL_YUV_CONFIG12_OFFSET (0x20)
#define OSD_DRAW_H_REG_DRAW_TH_12                   OSD_DRAW_H_REG_DRAW_TH_12
#define OSD_DRAW_H_REG_DRAW_TH_12_POS               (0U)
#define OSD_DRAW_H_REG_DRAW_TH_12_LEN               (8U)
#define OSD_DRAW_H_REG_DRAW_TH_12_MSK               (((1U << OSD_DRAW_H_REG_DRAW_TH_12_LEN) - 1) << OSD_DRAW_H_REG_DRAW_TH_12_POS)
#define OSD_DRAW_H_REG_DRAW_TH_12_UMSK              (~(((1U << OSD_DRAW_H_REG_DRAW_TH_12_LEN) - 1) << OSD_DRAW_H_REG_DRAW_TH_12_POS))
#define OSD_DRAW_H_REG_DRAW_V_12                    OSD_DRAW_H_REG_DRAW_V_12
#define OSD_DRAW_H_REG_DRAW_V_12_POS                (8U)
#define OSD_DRAW_H_REG_DRAW_V_12_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_V_12_MSK                (((1U << OSD_DRAW_H_REG_DRAW_V_12_LEN) - 1) << OSD_DRAW_H_REG_DRAW_V_12_POS)
#define OSD_DRAW_H_REG_DRAW_V_12_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_V_12_LEN) - 1) << OSD_DRAW_H_REG_DRAW_V_12_POS))
#define OSD_DRAW_H_REG_DRAW_U_12                    OSD_DRAW_H_REG_DRAW_U_12
#define OSD_DRAW_H_REG_DRAW_U_12_POS                (16U)
#define OSD_DRAW_H_REG_DRAW_U_12_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_U_12_MSK                (((1U << OSD_DRAW_H_REG_DRAW_U_12_LEN) - 1) << OSD_DRAW_H_REG_DRAW_U_12_POS)
#define OSD_DRAW_H_REG_DRAW_U_12_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_U_12_LEN) - 1) << OSD_DRAW_H_REG_DRAW_U_12_POS))
#define OSD_DRAW_H_REG_DRAW_Y_12                    OSD_DRAW_H_REG_DRAW_Y_12
#define OSD_DRAW_H_REG_DRAW_Y_12_POS                (24U)
#define OSD_DRAW_H_REG_DRAW_Y_12_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_Y_12_MSK                (((1U << OSD_DRAW_H_REG_DRAW_Y_12_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_12_POS)
#define OSD_DRAW_H_REG_DRAW_Y_12_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_Y_12_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_12_POS))

/* 0x24 : draw_partial_x_config12 */
#define OSD_DRAW_H_DRAW_PARTIAL_X_CONFIG12_OFFSET (0x24)
#define OSD_DRAW_H_REG_DRAW_X_MIN_12              OSD_DRAW_H_REG_DRAW_X_MIN_12
#define OSD_DRAW_H_REG_DRAW_X_MIN_12_POS          (0U)
#define OSD_DRAW_H_REG_DRAW_X_MIN_12_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_X_MIN_12_MSK          (((1U << OSD_DRAW_H_REG_DRAW_X_MIN_12_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MIN_12_POS)
#define OSD_DRAW_H_REG_DRAW_X_MIN_12_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_X_MIN_12_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MIN_12_POS))
#define OSD_DRAW_H_REG_DRAW_X_MAX_12              OSD_DRAW_H_REG_DRAW_X_MAX_12
#define OSD_DRAW_H_REG_DRAW_X_MAX_12_POS          (16U)
#define OSD_DRAW_H_REG_DRAW_X_MAX_12_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_X_MAX_12_MSK          (((1U << OSD_DRAW_H_REG_DRAW_X_MAX_12_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MAX_12_POS)
#define OSD_DRAW_H_REG_DRAW_X_MAX_12_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_X_MAX_12_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MAX_12_POS))

/* 0x28 : draw_partial_y_config12 */
#define OSD_DRAW_H_DRAW_PARTIAL_Y_CONFIG12_OFFSET (0x28)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_12              OSD_DRAW_H_REG_DRAW_Y_MIN_12
#define OSD_DRAW_H_REG_DRAW_Y_MIN_12_POS          (0U)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_12_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_12_MSK          (((1U << OSD_DRAW_H_REG_DRAW_Y_MIN_12_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MIN_12_POS)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_12_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_Y_MIN_12_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MIN_12_POS))
#define OSD_DRAW_H_REG_DRAW_Y_MAX_12              OSD_DRAW_H_REG_DRAW_Y_MAX_12
#define OSD_DRAW_H_REG_DRAW_Y_MAX_12_POS          (16U)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_12_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_12_MSK          (((1U << OSD_DRAW_H_REG_DRAW_Y_MAX_12_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MAX_12_POS)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_12_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_Y_MAX_12_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MAX_12_POS))

