RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/osd_draw_h_reg.h
/* 0x2C : draw_partial_yuv_config13 */
#define OSD_DRAW_H_DRAW_PARTIAL_YUV_CONFIG13_OFFSET (0x2C)
#define OSD_DRAW_H_REG_DRAW_TH_13                   OSD_DRAW_H_REG_DRAW_TH_13
#define OSD_DRAW_H_REG_DRAW_TH_13_POS               (0U)
#define OSD_DRAW_H_REG_DRAW_TH_13_LEN               (8U)
#define OSD_DRAW_H_REG_DRAW_TH_13_MSK               (((1U << OSD_DRAW_H_REG_DRAW_TH_13_LEN) - 1) << OSD_DRAW_H_REG_DRAW_TH_13_POS)
#define OSD_DRAW_H_REG_DRAW_TH_13_UMSK              (~(((1U << OSD_DRAW_H_REG_DRAW_TH_13_LEN) - 1) << OSD_DRAW_H_REG_DRAW_TH_13_POS))
#define OSD_DRAW_H_REG_DRAW_V_13                    OSD_DRAW_H_REG_DRAW_V_13
#define OSD_DRAW_H_REG_DRAW_V_13_POS                (8U)
#define OSD_DRAW_H_REG_DRAW_V_13_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_V_13_MSK                (((1U << OSD_DRAW_H_REG_DRAW_V_13_LEN) - 1) << OSD_DRAW_H_REG_DRAW_V_13_POS)
#define OSD_DRAW_H_REG_DRAW_V_13_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_V_13_LEN) - 1) << OSD_DRAW_H_REG_DRAW_V_13_POS))
#define OSD_DRAW_H_REG_DRAW_U_13                    OSD_DRAW_H_REG_DRAW_U_13
#define OSD_DRAW_H_REG_DRAW_U_13_POS                (16U)
#define OSD_DRAW_H_REG_DRAW_U_13_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_U_13_MSK                (((1U << OSD_DRAW_H_REG_DRAW_U_13_LEN) - 1) << OSD_DRAW_H_REG_DRAW_U_13_POS)
#define OSD_DRAW_H_REG_DRAW_U_13_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_U_13_LEN) - 1) << OSD_DRAW_H_REG_DRAW_U_13_POS))
#define OSD_DRAW_H_REG_DRAW_Y_13                    OSD_DRAW_H_REG_DRAW_Y_13
#define OSD_DRAW_H_REG_DRAW_Y_13_POS                (24U)
#define OSD_DRAW_H_REG_DRAW_Y_13_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_Y_13_MSK                (((1U << OSD_DRAW_H_REG_DRAW_Y_13_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_13_POS)
#define OSD_DRAW_H_REG_DRAW_Y_13_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_Y_13_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_13_POS))

/* 0x30 : draw_partial_x_config13 */
#define OSD_DRAW_H_DRAW_PARTIAL_X_CONFIG13_OFFSET (0x30)
#define OSD_DRAW_H_REG_DRAW_X_MIN_13              OSD_DRAW_H_REG_DRAW_X_MIN_13
#define OSD_DRAW_H_REG_DRAW_X_MIN_13_POS          (0U)
#define OSD_DRAW_H_REG_DRAW_X_MIN_13_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_X_MIN_13_MSK          (((1U << OSD_DRAW_H_REG_DRAW_X_MIN_13_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MIN_13_POS)
#define OSD_DRAW_H_REG_DRAW_X_MIN_13_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_X_MIN_13_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MIN_13_POS))
#define OSD_DRAW_H_REG_DRAW_X_MAX_13              OSD_DRAW_H_REG_DRAW_X_MAX_13
#define OSD_DRAW_H_REG_DRAW_X_MAX_13_POS          (16U)
#define OSD_DRAW_H_REG_DRAW_X_MAX_13_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_X_MAX_13_MSK          (((1U << OSD_DRAW_H_REG_DRAW_X_MAX_13_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MAX_13_POS)
#define OSD_DRAW_H_REG_DRAW_X_MAX_13_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_X_MAX_13_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MAX_13_POS))

/* 0x34 : draw_partial_y_config13 */
#define OSD_DRAW_H_DRAW_PARTIAL_Y_CONFIG13_OFFSET (0x34)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_13              OSD_DRAW_H_REG_DRAW_Y_MIN_13
#define OSD_DRAW_H_REG_DRAW_Y_MIN_13_POS          (0U)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_13_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_13_MSK          (((1U << OSD_DRAW_H_REG_DRAW_Y_MIN_13_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MIN_13_POS)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_13_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_Y_MIN_13_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MIN_13_POS))
#define OSD_DRAW_H_REG_DRAW_Y_MAX_13              OSD_DRAW_H_REG_DRAW_Y_MAX_13
#define OSD_DRAW_H_REG_DRAW_Y_MAX_13_POS          (16U)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_13_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_13_MSK          (((1U << OSD_DRAW_H_REG_DRAW_Y_MAX_13_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MAX_13_POS)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_13_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_Y_MAX_13_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MAX_13_POS))

/* 0x38 : draw_partial_yuv_config14 */
#define OSD_DRAW_H_DRAW_PARTIAL_YUV_CONFIG14_OFFSET (0x38)
#define OSD_DRAW_H_REG_DRAW_TH_14                   OSD_DRAW_H_REG_DRAW_TH_14
#define OSD_DRAW_H_REG_DRAW_TH_14_POS               (0U)
#define OSD_DRAW_H_REG_DRAW_TH_14_LEN               (8U)
#define OSD_DRAW_H_REG_DRAW_TH_14_MSK               (((1U << OSD_DRAW_H_REG_DRAW_TH_14_LEN) - 1) << OSD_DRAW_H_REG_DRAW_TH_14_POS)
#define OSD_DRAW_H_REG_DRAW_TH_14_UMSK              (~(((1U << OSD_DRAW_H_REG_DRAW_TH_14_LEN) - 1) << OSD_DRAW_H_REG_DRAW_TH_14_POS))
#define OSD_DRAW_H_REG_DRAW_V_14                    OSD_DRAW_H_REG_DRAW_V_14
#define OSD_DRAW_H_REG_DRAW_V_14_POS                (8U)
#define OSD_DRAW_H_REG_DRAW_V_14_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_V_14_MSK                (((1U << OSD_DRAW_H_REG_DRAW_V_14_LEN) - 1) << OSD_DRAW_H_REG_DRAW_V_14_POS)
#define OSD_DRAW_H_REG_DRAW_V_14_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_V_14_LEN) - 1) << OSD_DRAW_H_REG_DRAW_V_14_POS))
#define OSD_DRAW_H_REG_DRAW_U_14                    OSD_DRAW_H_REG_DRAW_U_14
#define OSD_DRAW_H_REG_DRAW_U_14_POS                (16U)
#define OSD_DRAW_H_REG_DRAW_U_14_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_U_14_MSK                (((1U << OSD_DRAW_H_REG_DRAW_U_14_LEN) - 1) << OSD_DRAW_H_REG_DRAW_U_14_POS)
#define OSD_DRAW_H_REG_DRAW_U_14_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_U_14_LEN) - 1) << OSD_DRAW_H_REG_DRAW_U_14_POS))
#define OSD_DRAW_H_REG_DRAW_Y_14                    OSD_DRAW_H_REG_DRAW_Y_14
#define OSD_DRAW_H_REG_DRAW_Y_14_POS                (24U)
#define OSD_DRAW_H_REG_DRAW_Y_14_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_Y_14_MSK                (((1U << OSD_DRAW_H_REG_DRAW_Y_14_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_14_POS)
#define OSD_DRAW_H_REG_DRAW_Y_14_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_Y_14_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_14_POS))

/* 0x3C : draw_partial_x_config14 */
#define OSD_DRAW_H_DRAW_PARTIAL_X_CONFIG14_OFFSET (0x3C)
#define OSD_DRAW_H_REG_DRAW_X_MIN_14              OSD_DRAW_H_REG_DRAW_X_MIN_14
#define OSD_DRAW_H_REG_DRAW_X_MIN_14_POS          (0U)
#define OSD_DRAW_H_REG_DRAW_X_MIN_14_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_X_MIN_14_MSK          (((1U << OSD_DRAW_H_REG_DRAW_X_MIN_14_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MIN_14_POS)
#define OSD_DRAW_H_REG_DRAW_X_MIN_14_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_X_MIN_14_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MIN_14_POS))
#define OSD_DRAW_H_REG_DRAW_X_MAX_14              OSD_DRAW_H_REG_DRAW_X_MAX_14
#define OSD_DRAW_H_REG_DRAW_X_MAX_14_POS          (16U)
#define OSD_DRAW_H_REG_DRAW_X_MAX_14_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_X_MAX_14_MSK          (((1U << OSD_DRAW_H_REG_DRAW_X_MAX_14_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MAX_14_POS)
#define OSD_DRAW_H_REG_DRAW_X_MAX_14_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_X_MAX_14_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MAX_14_POS))

/* 0x40 : draw_partial_y_config14 */
#define OSD_DRAW_H_DRAW_PARTIAL_Y_CONFIG14_OFFSET (0x40)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_14              OSD_DRAW_H_REG_DRAW_Y_MIN_14
#define OSD_DRAW_H_REG_DRAW_Y_MIN_14_POS          (0U)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_14_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_14_MSK          (((1U << OSD_DRAW_H_REG_DRAW_Y_MIN_14_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MIN_14_POS)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_14_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_Y_MIN_14_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MIN_14_POS))
#define OSD_DRAW_H_REG_DRAW_Y_MAX_14              OSD_DRAW_H_REG_DRAW_Y_MAX_14
#define OSD_DRAW_H_REG_DRAW_Y_MAX_14_POS          (16U)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_14_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_14_MSK          (((1U << OSD_DRAW_H_REG_DRAW_Y_MAX_14_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MAX_14_POS)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_14_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_Y_MAX_14_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MAX_14_POS))

