RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/osd_draw_h_reg.h
/* 0x44 : draw_partial_yuv_config15 */
#define OSD_DRAW_H_DRAW_PARTIAL_YUV_CONFIG15_OFFSET (0x44)
#define OSD_DRAW_H_REG_DRAW_TH_15                   OSD_DRAW_H_REG_DRAW_TH_15
#define OSD_DRAW_H_REG_DRAW_TH_15_POS               (0U)
#define OSD_DRAW_H_REG_DRAW_TH_15_LEN               (8U)
#define OSD_DRAW_H_REG_DRAW_TH_15_MSK               (((1U << OSD_DRAW_H_REG_DRAW_TH_15_LEN) - 1) << OSD_DRAW_H_REG_DRAW_TH_15_POS)
#define OSD_DRAW_H_REG_DRAW_TH_15_UMSK              (~(((1U << OSD_DRAW_H_REG_DRAW_TH_15_LEN) - 1) << OSD_DRAW_H_REG_DRAW_TH_15_POS))
#define OSD_DRAW_H_REG_DRAW_V_15                    OSD_DRAW_H_REG_DRAW_V_15
#define OSD_DRAW_H_REG_DRAW_V_15_POS                (8U)
#define OSD_DRAW_H_REG_DRAW_V_15_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_V_15_MSK                (((1U << OSD_DRAW_H_REG_DRAW_V_15_LEN) - 1) << OSD_DRAW_H_REG_DRAW_V_15_POS)
#define OSD_DRAW_H_REG_DRAW_V_15_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_V_15_LEN) - 1) << OSD_DRAW_H_REG_DRAW_V_15_POS))
#define OSD_DRAW_H_REG_DRAW_U_15                    OSD_DRAW_H_REG_DRAW_U_15
#define OSD_DRAW_H_REG_DRAW_U_15_POS                (16U)
#define OSD_DRAW_H_REG_DRAW_U_15_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_U_15_MSK                (((1U << OSD_DRAW_H_REG_DRAW_U_15_LEN) - 1) << OSD_DRAW_H_REG_DRAW_U_15_POS)
#define OSD_DRAW_H_REG_DRAW_U_15_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_U_15_LEN) - 1) << OSD_DRAW_H_REG_DRAW_U_15_POS))
#define OSD_DRAW_H_REG_DRAW_Y_15                    OSD_DRAW_H_REG_DRAW_Y_15
#define OSD_DRAW_H_REG_DRAW_Y_15_POS                (24U)
#define OSD_DRAW_H_REG_DRAW_Y_15_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_Y_15_MSK                (((1U << OSD_DRAW_H_REG_DRAW_Y_15_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_15_POS)
#define OSD_DRAW_H_REG_DRAW_Y_15_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_Y_15_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_15_POS))

/* 0x48 : draw_partial_x_config15 */
#define OSD_DRAW_H_DRAW_PARTIAL_X_CONFIG15_OFFSET (0x48)
#define OSD_DRAW_H_REG_DRAW_X_MIN_15              OSD_DRAW_H_REG_DRAW_X_MIN_15
#define OSD_DRAW_H_REG_DRAW_X_MIN_15_POS          (0U)
#define OSD_DRAW_H_REG_DRAW_X_MIN_15_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_X_MIN_15_MSK          (((1U << OSD_DRAW_H_REG_DRAW_X_MIN_15_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MIN_15_POS)
#define OSD_DRAW_H_REG_DRAW_X_MIN_15_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_X_MIN_15_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MIN_15_POS))
#define OSD_DRAW_H_REG_DRAW_X_MAX_15              OSD_DRAW_H_REG_DRAW_X_MAX_15
#define OSD_DRAW_H_REG_DRAW_X_MAX_15_POS          (16U)
#define OSD_DRAW_H_REG_DRAW_X_MAX_15_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_X_MAX_15_MSK          (((1U << OSD_DRAW_H_REG_DRAW_X_MAX_15_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MAX_15_POS)
#define OSD_DRAW_H_REG_DRAW_X_MAX_15_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_X_MAX_15_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MAX_15_POS))

/* 0x4C : draw_partial_y_config15 */
#define OSD_DRAW_H_DRAW_PARTIAL_Y_CONFIG15_OFFSET (0x4C)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_15              OSD_DRAW_H_REG_DRAW_Y_MIN_15
#define OSD_DRAW_H_REG_DRAW_Y_MIN_15_POS          (0U)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_15_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_15_MSK          (((1U << OSD_DRAW_H_REG_DRAW_Y_MIN_15_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MIN_15_POS)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_15_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_Y_MIN_15_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MIN_15_POS))
#define OSD_DRAW_H_REG_DRAW_Y_MAX_15              OSD_DRAW_H_REG_DRAW_Y_MAX_15
#define OSD_DRAW_H_REG_DRAW_Y_MAX_15_POS          (16U)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_15_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_15_MSK          (((1U << OSD_DRAW_H_REG_DRAW_Y_MAX_15_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MAX_15_POS)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_15_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_Y_MAX_15_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MAX_15_POS))

/* 0x50 : draw_partial_yuv_config16 */
#define OSD_DRAW_H_DRAW_PARTIAL_YUV_CONFIG16_OFFSET (0x50)
#define OSD_DRAW_H_REG_DRAW_TH_16                   OSD_DRAW_H_REG_DRAW_TH_16
#define OSD_DRAW_H_REG_DRAW_TH_16_POS               (0U)
#define OSD_DRAW_H_REG_DRAW_TH_16_LEN               (8U)
#define OSD_DRAW_H_REG_DRAW_TH_16_MSK               (((1U << OSD_DRAW_H_REG_DRAW_TH_16_LEN) - 1) << OSD_DRAW_H_REG_DRAW_TH_16_POS)
#define OSD_DRAW_H_REG_DRAW_TH_16_UMSK              (~(((1U << OSD_DRAW_H_REG_DRAW_TH_16_LEN) - 1) << OSD_DRAW_H_REG_DRAW_TH_16_POS))
#define OSD_DRAW_H_REG_DRAW_V_16                    OSD_DRAW_H_REG_DRAW_V_16
#define OSD_DRAW_H_REG_DRAW_V_16_POS                (8U)
#define OSD_DRAW_H_REG_DRAW_V_16_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_V_16_MSK                (((1U << OSD_DRAW_H_REG_DRAW_V_16_LEN) - 1) << OSD_DRAW_H_REG_DRAW_V_16_POS)
#define OSD_DRAW_H_REG_DRAW_V_16_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_V_16_LEN) - 1) << OSD_DRAW_H_REG_DRAW_V_16_POS))
#define OSD_DRAW_H_REG_DRAW_U_16                    OSD_DRAW_H_REG_DRAW_U_16
#define OSD_DRAW_H_REG_DRAW_U_16_POS                (16U)
#define OSD_DRAW_H_REG_DRAW_U_16_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_U_16_MSK                (((1U << OSD_DRAW_H_REG_DRAW_U_16_LEN) - 1) << OSD_DRAW_H_REG_DRAW_U_16_POS)
#define OSD_DRAW_H_REG_DRAW_U_16_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_U_16_LEN) - 1) << OSD_DRAW_H_REG_DRAW_U_16_POS))
#define OSD_DRAW_H_REG_DRAW_Y_16                    OSD_DRAW_H_REG_DRAW_Y_16
#define OSD_DRAW_H_REG_DRAW_Y_16_POS                (24U)
#define OSD_DRAW_H_REG_DRAW_Y_16_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_Y_16_MSK                (((1U << OSD_DRAW_H_REG_DRAW_Y_16_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_16_POS)
#define OSD_DRAW_H_REG_DRAW_Y_16_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_Y_16_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_16_POS))

/* 0x54 : draw_partial_x_config16 */
#define OSD_DRAW_H_DRAW_PARTIAL_X_CONFIG16_OFFSET (0x54)
#define OSD_DRAW_H_REG_DRAW_X_MIN_16              OSD_DRAW_H_REG_DRAW_X_MIN_16
#define OSD_DRAW_H_REG_DRAW_X_MIN_16_POS          (0U)
#define OSD_DRAW_H_REG_DRAW_X_MIN_16_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_X_MIN_16_MSK          (((1U << OSD_DRAW_H_REG_DRAW_X_MIN_16_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MIN_16_POS)
#define OSD_DRAW_H_REG_DRAW_X_MIN_16_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_X_MIN_16_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MIN_16_POS))
#define OSD_DRAW_H_REG_DRAW_X_MAX_16              OSD_DRAW_H_REG_DRAW_X_MAX_16
#define OSD_DRAW_H_REG_DRAW_X_MAX_16_POS          (16U)
#define OSD_DRAW_H_REG_DRAW_X_MAX_16_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_X_MAX_16_MSK          (((1U << OSD_DRAW_H_REG_DRAW_X_MAX_16_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MAX_16_POS)
#define OSD_DRAW_H_REG_DRAW_X_MAX_16_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_X_MAX_16_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MAX_16_POS))

/* 0x58 : draw_partial_y_config16 */
#define OSD_DRAW_H_DRAW_PARTIAL_Y_CONFIG16_OFFSET (0x58)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_16              OSD_DRAW_H_REG_DRAW_Y_MIN_16
#define OSD_DRAW_H_REG_DRAW_Y_MIN_16_POS          (0U)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_16_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_16_MSK          (((1U << OSD_DRAW_H_REG_DRAW_Y_MIN_16_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MIN_16_POS)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_16_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_Y_MIN_16_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MIN_16_POS))
#define OSD_DRAW_H_REG_DRAW_Y_MAX_16              OSD_DRAW_H_REG_DRAW_Y_MAX_16
#define OSD_DRAW_H_REG_DRAW_Y_MAX_16_POS          (16U)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_16_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_16_MSK          (((1U << OSD_DRAW_H_REG_DRAW_Y_MAX_16_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MAX_16_POS)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_16_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_Y_MAX_16_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MAX_16_POS))

/* 0x5C : draw_partial_yuv_config17 */
#define OSD_DRAW_H_DRAW_PARTIAL_YUV_CONFIG17_OFFSET (0x5C)
#define OSD_DRAW_H_REG_DRAW_TH_17                   OSD_DRAW_H_REG_DRAW_TH_17
#define OSD_DRAW_H_REG_DRAW_TH_17_POS               (0U)
#define OSD_DRAW_H_REG_DRAW_TH_17_LEN               (8U)
#define OSD_DRAW_H_REG_DRAW_TH_17_MSK               (((1U << OSD_DRAW_H_REG_DRAW_TH_17_LEN) - 1) << OSD_DRAW_H_REG_DRAW_TH_17_POS)
#define OSD_DRAW_H_REG_DRAW_TH_17_UMSK              (~(((1U << OSD_DRAW_H_REG_DRAW_TH_17_LEN) - 1) << OSD_DRAW_H_REG_DRAW_TH_17_POS))
#define OSD_DRAW_H_REG_DRAW_V_17                    OSD_DRAW_H_REG_DRAW_V_17
#define OSD_DRAW_H_REG_DRAW_V_17_POS                (8U)
#define OSD_DRAW_H_REG_DRAW_V_17_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_V_17_MSK                (((1U << OSD_DRAW_H_REG_DRAW_V_17_LEN) - 1) << OSD_DRAW_H_REG_DRAW_V_17_POS)
#define OSD_DRAW_H_REG_DRAW_V_17_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_V_17_LEN) - 1) << OSD_DRAW_H_REG_DRAW_V_17_POS))
#define OSD_DRAW_H_REG_DRAW_U_17                    OSD_DRAW_H_REG_DRAW_U_17
#define OSD_DRAW_H_REG_DRAW_U_17_POS                (16U)
#define OSD_DRAW_H_REG_DRAW_U_17_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_U_17_MSK                (((1U << OSD_DRAW_H_REG_DRAW_U_17_LEN) - 1) << OSD_DRAW_H_REG_DRAW_U_17_POS)
#define OSD_DRAW_H_REG_DRAW_U_17_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_U_17_LEN) - 1) << OSD_DRAW_H_REG_DRAW_U_17_POS))
#define OSD_DRAW_H_REG_DRAW_Y_17                    OSD_DRAW_H_REG_DRAW_Y_17
#define OSD_DRAW_H_REG_DRAW_Y_17_POS                (24U)
#define OSD_DRAW_H_REG_DRAW_Y_17_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_Y_17_MSK                (((1U << OSD_DRAW_H_REG_DRAW_Y_17_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_17_POS)
#define OSD_DRAW_H_REG_DRAW_Y_17_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_Y_17_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_17_POS))

