RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/osd_draw_h_reg.h
/* 0x60 : draw_partial_x_config17 */
#define OSD_DRAW_H_DRAW_PARTIAL_X_CONFIG17_OFFSET (0x60)
#define OSD_DRAW_H_REG_DRAW_X_MIN_17              OSD_DRAW_H_REG_DRAW_X_MIN_17
#define OSD_DRAW_H_REG_DRAW_X_MIN_17_POS          (0U)
#define OSD_DRAW_H_REG_DRAW_X_MIN_17_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_X_MIN_17_MSK          (((1U << OSD_DRAW_H_REG_DRAW_X_MIN_17_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MIN_17_POS)
#define OSD_DRAW_H_REG_DRAW_X_MIN_17_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_X_MIN_17_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MIN_17_POS))
#define OSD_DRAW_H_REG_DRAW_X_MAX_17              OSD_DRAW_H_REG_DRAW_X_MAX_17
#define OSD_DRAW_H_REG_DRAW_X_MAX_17_POS          (16U)
#define OSD_DRAW_H_REG_DRAW_X_MAX_17_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_X_MAX_17_MSK          (((1U << OSD_DRAW_H_REG_DRAW_X_MAX_17_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MAX_17_POS)
#define OSD_DRAW_H_REG_DRAW_X_MAX_17_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_X_MAX_17_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MAX_17_POS))

/* 0x64 : draw_partial_y_config17 */
#define OSD_DRAW_H_DRAW_PARTIAL_Y_CONFIG17_OFFSET (0x64)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_17              OSD_DRAW_H_REG_DRAW_Y_MIN_17
#define OSD_DRAW_H_REG_DRAW_Y_MIN_17_POS          (0U)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_17_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_17_MSK          (((1U << OSD_DRAW_H_REG_DRAW_Y_MIN_17_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MIN_17_POS)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_17_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_Y_MIN_17_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MIN_17_POS))
#define OSD_DRAW_H_REG_DRAW_Y_MAX_17              OSD_DRAW_H_REG_DRAW_Y_MAX_17
#define OSD_DRAW_H_REG_DRAW_Y_MAX_17_POS          (16U)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_17_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_17_MSK          (((1U << OSD_DRAW_H_REG_DRAW_Y_MAX_17_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MAX_17_POS)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_17_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_Y_MAX_17_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MAX_17_POS))

/* 0x68 : draw_partial_yuv_config18 */
#define OSD_DRAW_H_DRAW_PARTIAL_YUV_CONFIG18_OFFSET (0x68)
#define OSD_DRAW_H_REG_DRAW_TH_18                   OSD_DRAW_H_REG_DRAW_TH_18
#define OSD_DRAW_H_REG_DRAW_TH_18_POS               (0U)
#define OSD_DRAW_H_REG_DRAW_TH_18_LEN               (8U)
#define OSD_DRAW_H_REG_DRAW_TH_18_MSK               (((1U << OSD_DRAW_H_REG_DRAW_TH_18_LEN) - 1) << OSD_DRAW_H_REG_DRAW_TH_18_POS)
#define OSD_DRAW_H_REG_DRAW_TH_18_UMSK              (~(((1U << OSD_DRAW_H_REG_DRAW_TH_18_LEN) - 1) << OSD_DRAW_H_REG_DRAW_TH_18_POS))
#define OSD_DRAW_H_REG_DRAW_V_18                    OSD_DRAW_H_REG_DRAW_V_18
#define OSD_DRAW_H_REG_DRAW_V_18_POS                (8U)
#define OSD_DRAW_H_REG_DRAW_V_18_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_V_18_MSK                (((1U << OSD_DRAW_H_REG_DRAW_V_18_LEN) - 1) << OSD_DRAW_H_REG_DRAW_V_18_POS)
#define OSD_DRAW_H_REG_DRAW_V_18_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_V_18_LEN) - 1) << OSD_DRAW_H_REG_DRAW_V_18_POS))
#define OSD_DRAW_H_REG_DRAW_U_18                    OSD_DRAW_H_REG_DRAW_U_18
#define OSD_DRAW_H_REG_DRAW_U_18_POS                (16U)
#define OSD_DRAW_H_REG_DRAW_U_18_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_U_18_MSK                (((1U << OSD_DRAW_H_REG_DRAW_U_18_LEN) - 1) << OSD_DRAW_H_REG_DRAW_U_18_POS)
#define OSD_DRAW_H_REG_DRAW_U_18_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_U_18_LEN) - 1) << OSD_DRAW_H_REG_DRAW_U_18_POS))
#define OSD_DRAW_H_REG_DRAW_Y_18                    OSD_DRAW_H_REG_DRAW_Y_18
#define OSD_DRAW_H_REG_DRAW_Y_18_POS                (24U)
#define OSD_DRAW_H_REG_DRAW_Y_18_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_Y_18_MSK                (((1U << OSD_DRAW_H_REG_DRAW_Y_18_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_18_POS)
#define OSD_DRAW_H_REG_DRAW_Y_18_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_Y_18_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_18_POS))

/* 0x6C : draw_partial_x_config18 */
#define OSD_DRAW_H_DRAW_PARTIAL_X_CONFIG18_OFFSET (0x6C)
#define OSD_DRAW_H_REG_DRAW_X_MIN_18              OSD_DRAW_H_REG_DRAW_X_MIN_18
#define OSD_DRAW_H_REG_DRAW_X_MIN_18_POS          (0U)
#define OSD_DRAW_H_REG_DRAW_X_MIN_18_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_X_MIN_18_MSK          (((1U << OSD_DRAW_H_REG_DRAW_X_MIN_18_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MIN_18_POS)
#define OSD_DRAW_H_REG_DRAW_X_MIN_18_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_X_MIN_18_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MIN_18_POS))
#define OSD_DRAW_H_REG_DRAW_X_MAX_18              OSD_DRAW_H_REG_DRAW_X_MAX_18
#define OSD_DRAW_H_REG_DRAW_X_MAX_18_POS          (16U)
#define OSD_DRAW_H_REG_DRAW_X_MAX_18_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_X_MAX_18_MSK          (((1U << OSD_DRAW_H_REG_DRAW_X_MAX_18_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MAX_18_POS)
#define OSD_DRAW_H_REG_DRAW_X_MAX_18_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_X_MAX_18_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MAX_18_POS))

/* 0x70 : draw_partial_y_config18 */
#define OSD_DRAW_H_DRAW_PARTIAL_Y_CONFIG18_OFFSET (0x70)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_18              OSD_DRAW_H_REG_DRAW_Y_MIN_18
#define OSD_DRAW_H_REG_DRAW_Y_MIN_18_POS          (0U)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_18_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_18_MSK          (((1U << OSD_DRAW_H_REG_DRAW_Y_MIN_18_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MIN_18_POS)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_18_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_Y_MIN_18_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MIN_18_POS))
#define OSD_DRAW_H_REG_DRAW_Y_MAX_18              OSD_DRAW_H_REG_DRAW_Y_MAX_18
#define OSD_DRAW_H_REG_DRAW_Y_MAX_18_POS          (16U)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_18_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_18_MSK          (((1U << OSD_DRAW_H_REG_DRAW_Y_MAX_18_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MAX_18_POS)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_18_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_Y_MAX_18_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MAX_18_POS))

/* 0x74 : draw_partial_yuv_config19 */
#define OSD_DRAW_H_DRAW_PARTIAL_YUV_CONFIG19_OFFSET (0x74)
#define OSD_DRAW_H_REG_DRAW_TH_19                   OSD_DRAW_H_REG_DRAW_TH_19
#define OSD_DRAW_H_REG_DRAW_TH_19_POS               (0U)
#define OSD_DRAW_H_REG_DRAW_TH_19_LEN               (8U)
#define OSD_DRAW_H_REG_DRAW_TH_19_MSK               (((1U << OSD_DRAW_H_REG_DRAW_TH_19_LEN) - 1) << OSD_DRAW_H_REG_DRAW_TH_19_POS)
#define OSD_DRAW_H_REG_DRAW_TH_19_UMSK              (~(((1U << OSD_DRAW_H_REG_DRAW_TH_19_LEN) - 1) << OSD_DRAW_H_REG_DRAW_TH_19_POS))
#define OSD_DRAW_H_REG_DRAW_V_19                    OSD_DRAW_H_REG_DRAW_V_19
#define OSD_DRAW_H_REG_DRAW_V_19_POS                (8U)
#define OSD_DRAW_H_REG_DRAW_V_19_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_V_19_MSK                (((1U << OSD_DRAW_H_REG_DRAW_V_19_LEN) - 1) << OSD_DRAW_H_REG_DRAW_V_19_POS)
#define OSD_DRAW_H_REG_DRAW_V_19_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_V_19_LEN) - 1) << OSD_DRAW_H_REG_DRAW_V_19_POS))
#define OSD_DRAW_H_REG_DRAW_U_19                    OSD_DRAW_H_REG_DRAW_U_19
#define OSD_DRAW_H_REG_DRAW_U_19_POS                (16U)
#define OSD_DRAW_H_REG_DRAW_U_19_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_U_19_MSK                (((1U << OSD_DRAW_H_REG_DRAW_U_19_LEN) - 1) << OSD_DRAW_H_REG_DRAW_U_19_POS)
#define OSD_DRAW_H_REG_DRAW_U_19_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_U_19_LEN) - 1) << OSD_DRAW_H_REG_DRAW_U_19_POS))
#define OSD_DRAW_H_REG_DRAW_Y_19                    OSD_DRAW_H_REG_DRAW_Y_19
#define OSD_DRAW_H_REG_DRAW_Y_19_POS                (24U)
#define OSD_DRAW_H_REG_DRAW_Y_19_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_Y_19_MSK                (((1U << OSD_DRAW_H_REG_DRAW_Y_19_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_19_POS)
#define OSD_DRAW_H_REG_DRAW_Y_19_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_Y_19_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_19_POS))

/* 0x78 : draw_partial_x_config19 */
#define OSD_DRAW_H_DRAW_PARTIAL_X_CONFIG19_OFFSET (0x78)
#define OSD_DRAW_H_REG_DRAW_X_MIN_19              OSD_DRAW_H_REG_DRAW_X_MIN_19
#define OSD_DRAW_H_REG_DRAW_X_MIN_19_POS          (0U)
#define OSD_DRAW_H_REG_DRAW_X_MIN_19_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_X_MIN_19_MSK          (((1U << OSD_DRAW_H_REG_DRAW_X_MIN_19_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MIN_19_POS)
#define OSD_DRAW_H_REG_DRAW_X_MIN_19_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_X_MIN_19_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MIN_19_POS))
#define OSD_DRAW_H_REG_DRAW_X_MAX_19              OSD_DRAW_H_REG_DRAW_X_MAX_19
#define OSD_DRAW_H_REG_DRAW_X_MAX_19_POS          (16U)
#define OSD_DRAW_H_REG_DRAW_X_MAX_19_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_X_MAX_19_MSK          (((1U << OSD_DRAW_H_REG_DRAW_X_MAX_19_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MAX_19_POS)
#define OSD_DRAW_H_REG_DRAW_X_MAX_19_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_X_MAX_19_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MAX_19_POS))

