RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/osd_draw_h_reg.h
/* 0x7C : draw_partial_y_config19 */
#define OSD_DRAW_H_DRAW_PARTIAL_Y_CONFIG19_OFFSET (0x7C)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_19              OSD_DRAW_H_REG_DRAW_Y_MIN_19
#define OSD_DRAW_H_REG_DRAW_Y_MIN_19_POS          (0U)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_19_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_19_MSK          (((1U << OSD_DRAW_H_REG_DRAW_Y_MIN_19_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MIN_19_POS)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_19_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_Y_MIN_19_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MIN_19_POS))
#define OSD_DRAW_H_REG_DRAW_Y_MAX_19              OSD_DRAW_H_REG_DRAW_Y_MAX_19
#define OSD_DRAW_H_REG_DRAW_Y_MAX_19_POS          (16U)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_19_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_19_MSK          (((1U << OSD_DRAW_H_REG_DRAW_Y_MAX_19_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MAX_19_POS)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_19_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_Y_MAX_19_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MAX_19_POS))

/* 0x80 : draw_partial_yuv_config1a */
#define OSD_DRAW_H_DRAW_PARTIAL_YUV_CONFIG1A_OFFSET (0x80)
#define OSD_DRAW_H_REG_DRAW_TH_1A                   OSD_DRAW_H_REG_DRAW_TH_1A
#define OSD_DRAW_H_REG_DRAW_TH_1A_POS               (0U)
#define OSD_DRAW_H_REG_DRAW_TH_1A_LEN               (8U)
#define OSD_DRAW_H_REG_DRAW_TH_1A_MSK               (((1U << OSD_DRAW_H_REG_DRAW_TH_1A_LEN) - 1) << OSD_DRAW_H_REG_DRAW_TH_1A_POS)
#define OSD_DRAW_H_REG_DRAW_TH_1A_UMSK              (~(((1U << OSD_DRAW_H_REG_DRAW_TH_1A_LEN) - 1) << OSD_DRAW_H_REG_DRAW_TH_1A_POS))
#define OSD_DRAW_H_REG_DRAW_V_1A                    OSD_DRAW_H_REG_DRAW_V_1A
#define OSD_DRAW_H_REG_DRAW_V_1A_POS                (8U)
#define OSD_DRAW_H_REG_DRAW_V_1A_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_V_1A_MSK                (((1U << OSD_DRAW_H_REG_DRAW_V_1A_LEN) - 1) << OSD_DRAW_H_REG_DRAW_V_1A_POS)
#define OSD_DRAW_H_REG_DRAW_V_1A_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_V_1A_LEN) - 1) << OSD_DRAW_H_REG_DRAW_V_1A_POS))
#define OSD_DRAW_H_REG_DRAW_U_1A                    OSD_DRAW_H_REG_DRAW_U_1A
#define OSD_DRAW_H_REG_DRAW_U_1A_POS                (16U)
#define OSD_DRAW_H_REG_DRAW_U_1A_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_U_1A_MSK                (((1U << OSD_DRAW_H_REG_DRAW_U_1A_LEN) - 1) << OSD_DRAW_H_REG_DRAW_U_1A_POS)
#define OSD_DRAW_H_REG_DRAW_U_1A_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_U_1A_LEN) - 1) << OSD_DRAW_H_REG_DRAW_U_1A_POS))
#define OSD_DRAW_H_REG_DRAW_Y_1A                    OSD_DRAW_H_REG_DRAW_Y_1A
#define OSD_DRAW_H_REG_DRAW_Y_1A_POS                (24U)
#define OSD_DRAW_H_REG_DRAW_Y_1A_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_Y_1A_MSK                (((1U << OSD_DRAW_H_REG_DRAW_Y_1A_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_1A_POS)
#define OSD_DRAW_H_REG_DRAW_Y_1A_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_Y_1A_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_1A_POS))

/* 0x84 : draw_partial_x_config1a */
#define OSD_DRAW_H_DRAW_PARTIAL_X_CONFIG1A_OFFSET (0x84)
#define OSD_DRAW_H_REG_DRAW_X_MIN_1A              OSD_DRAW_H_REG_DRAW_X_MIN_1A
#define OSD_DRAW_H_REG_DRAW_X_MIN_1A_POS          (0U)
#define OSD_DRAW_H_REG_DRAW_X_MIN_1A_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_X_MIN_1A_MSK          (((1U << OSD_DRAW_H_REG_DRAW_X_MIN_1A_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MIN_1A_POS)
#define OSD_DRAW_H_REG_DRAW_X_MIN_1A_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_X_MIN_1A_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MIN_1A_POS))
#define OSD_DRAW_H_REG_DRAW_X_MAX_1A              OSD_DRAW_H_REG_DRAW_X_MAX_1A
#define OSD_DRAW_H_REG_DRAW_X_MAX_1A_POS          (16U)
#define OSD_DRAW_H_REG_DRAW_X_MAX_1A_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_X_MAX_1A_MSK          (((1U << OSD_DRAW_H_REG_DRAW_X_MAX_1A_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MAX_1A_POS)
#define OSD_DRAW_H_REG_DRAW_X_MAX_1A_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_X_MAX_1A_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MAX_1A_POS))

/* 0x88 : draw_partial_y_config1a */
#define OSD_DRAW_H_DRAW_PARTIAL_Y_CONFIG1A_OFFSET (0x88)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_1A              OSD_DRAW_H_REG_DRAW_Y_MIN_1A
#define OSD_DRAW_H_REG_DRAW_Y_MIN_1A_POS          (0U)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_1A_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_1A_MSK          (((1U << OSD_DRAW_H_REG_DRAW_Y_MIN_1A_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MIN_1A_POS)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_1A_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_Y_MIN_1A_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MIN_1A_POS))
#define OSD_DRAW_H_REG_DRAW_Y_MAX_1A              OSD_DRAW_H_REG_DRAW_Y_MAX_1A
#define OSD_DRAW_H_REG_DRAW_Y_MAX_1A_POS          (16U)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_1A_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_1A_MSK          (((1U << OSD_DRAW_H_REG_DRAW_Y_MAX_1A_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MAX_1A_POS)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_1A_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_Y_MAX_1A_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MAX_1A_POS))

/* 0x8C : draw_partial_yuv_config1b */
#define OSD_DRAW_H_DRAW_PARTIAL_YUV_CONFIG1B_OFFSET (0x8C)
#define OSD_DRAW_H_REG_DRAW_TH_1B                   OSD_DRAW_H_REG_DRAW_TH_1B
#define OSD_DRAW_H_REG_DRAW_TH_1B_POS               (0U)
#define OSD_DRAW_H_REG_DRAW_TH_1B_LEN               (8U)
#define OSD_DRAW_H_REG_DRAW_TH_1B_MSK               (((1U << OSD_DRAW_H_REG_DRAW_TH_1B_LEN) - 1) << OSD_DRAW_H_REG_DRAW_TH_1B_POS)
#define OSD_DRAW_H_REG_DRAW_TH_1B_UMSK              (~(((1U << OSD_DRAW_H_REG_DRAW_TH_1B_LEN) - 1) << OSD_DRAW_H_REG_DRAW_TH_1B_POS))
#define OSD_DRAW_H_REG_DRAW_V_1B                    OSD_DRAW_H_REG_DRAW_V_1B
#define OSD_DRAW_H_REG_DRAW_V_1B_POS                (8U)
#define OSD_DRAW_H_REG_DRAW_V_1B_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_V_1B_MSK                (((1U << OSD_DRAW_H_REG_DRAW_V_1B_LEN) - 1) << OSD_DRAW_H_REG_DRAW_V_1B_POS)
#define OSD_DRAW_H_REG_DRAW_V_1B_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_V_1B_LEN) - 1) << OSD_DRAW_H_REG_DRAW_V_1B_POS))
#define OSD_DRAW_H_REG_DRAW_U_1B                    OSD_DRAW_H_REG_DRAW_U_1B
#define OSD_DRAW_H_REG_DRAW_U_1B_POS                (16U)
#define OSD_DRAW_H_REG_DRAW_U_1B_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_U_1B_MSK                (((1U << OSD_DRAW_H_REG_DRAW_U_1B_LEN) - 1) << OSD_DRAW_H_REG_DRAW_U_1B_POS)
#define OSD_DRAW_H_REG_DRAW_U_1B_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_U_1B_LEN) - 1) << OSD_DRAW_H_REG_DRAW_U_1B_POS))
#define OSD_DRAW_H_REG_DRAW_Y_1B                    OSD_DRAW_H_REG_DRAW_Y_1B
#define OSD_DRAW_H_REG_DRAW_Y_1B_POS                (24U)
#define OSD_DRAW_H_REG_DRAW_Y_1B_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_Y_1B_MSK                (((1U << OSD_DRAW_H_REG_DRAW_Y_1B_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_1B_POS)
#define OSD_DRAW_H_REG_DRAW_Y_1B_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_Y_1B_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_1B_POS))

/* 0x90 : draw_partial_x_config1b */
#define OSD_DRAW_H_DRAW_PARTIAL_X_CONFIG1B_OFFSET (0x90)
#define OSD_DRAW_H_REG_DRAW_X_MIN_1B              OSD_DRAW_H_REG_DRAW_X_MIN_1B
#define OSD_DRAW_H_REG_DRAW_X_MIN_1B_POS          (0U)
#define OSD_DRAW_H_REG_DRAW_X_MIN_1B_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_X_MIN_1B_MSK          (((1U << OSD_DRAW_H_REG_DRAW_X_MIN_1B_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MIN_1B_POS)
#define OSD_DRAW_H_REG_DRAW_X_MIN_1B_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_X_MIN_1B_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MIN_1B_POS))
#define OSD_DRAW_H_REG_DRAW_X_MAX_1B              OSD_DRAW_H_REG_DRAW_X_MAX_1B
#define OSD_DRAW_H_REG_DRAW_X_MAX_1B_POS          (16U)
#define OSD_DRAW_H_REG_DRAW_X_MAX_1B_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_X_MAX_1B_MSK          (((1U << OSD_DRAW_H_REG_DRAW_X_MAX_1B_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MAX_1B_POS)
#define OSD_DRAW_H_REG_DRAW_X_MAX_1B_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_X_MAX_1B_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MAX_1B_POS))

/* 0x94 : draw_partial_y_config1b */
#define OSD_DRAW_H_DRAW_PARTIAL_Y_CONFIG1B_OFFSET (0x94)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_1B              OSD_DRAW_H_REG_DRAW_Y_MIN_1B
#define OSD_DRAW_H_REG_DRAW_Y_MIN_1B_POS          (0U)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_1B_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_1B_MSK          (((1U << OSD_DRAW_H_REG_DRAW_Y_MIN_1B_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MIN_1B_POS)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_1B_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_Y_MIN_1B_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MIN_1B_POS))
#define OSD_DRAW_H_REG_DRAW_Y_MAX_1B              OSD_DRAW_H_REG_DRAW_Y_MAX_1B
#define OSD_DRAW_H_REG_DRAW_Y_MAX_1B_POS          (16U)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_1B_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_1B_MSK          (((1U << OSD_DRAW_H_REG_DRAW_Y_MAX_1B_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MAX_1B_POS)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_1B_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_Y_MAX_1B_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MAX_1B_POS))

/* 0x98 : draw_partial_yuv_config1c */
#define OSD_DRAW_H_DRAW_PARTIAL_YUV_CONFIG1C_OFFSET (0x98)
#define OSD_DRAW_H_REG_DRAW_TH_1C                   OSD_DRAW_H_REG_DRAW_TH_1C
#define OSD_DRAW_H_REG_DRAW_TH_1C_POS               (0U)
#define OSD_DRAW_H_REG_DRAW_TH_1C_LEN               (8U)
#define OSD_DRAW_H_REG_DRAW_TH_1C_MSK               (((1U << OSD_DRAW_H_REG_DRAW_TH_1C_LEN) - 1) << OSD_DRAW_H_REG_DRAW_TH_1C_POS)
#define OSD_DRAW_H_REG_DRAW_TH_1C_UMSK              (~(((1U << OSD_DRAW_H_REG_DRAW_TH_1C_LEN) - 1) << OSD_DRAW_H_REG_DRAW_TH_1C_POS))
#define OSD_DRAW_H_REG_DRAW_V_1C                    OSD_DRAW_H_REG_DRAW_V_1C
#define OSD_DRAW_H_REG_DRAW_V_1C_POS                (8U)
#define OSD_DRAW_H_REG_DRAW_V_1C_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_V_1C_MSK                (((1U << OSD_DRAW_H_REG_DRAW_V_1C_LEN) - 1) << OSD_DRAW_H_REG_DRAW_V_1C_POS)
#define OSD_DRAW_H_REG_DRAW_V_1C_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_V_1C_LEN) - 1) << OSD_DRAW_H_REG_DRAW_V_1C_POS))
#define OSD_DRAW_H_REG_DRAW_U_1C                    OSD_DRAW_H_REG_DRAW_U_1C
#define OSD_DRAW_H_REG_DRAW_U_1C_POS                (16U)
#define OSD_DRAW_H_REG_DRAW_U_1C_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_U_1C_MSK                (((1U << OSD_DRAW_H_REG_DRAW_U_1C_LEN) - 1) << OSD_DRAW_H_REG_DRAW_U_1C_POS)
#define OSD_DRAW_H_REG_DRAW_U_1C_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_U_1C_LEN) - 1) << OSD_DRAW_H_REG_DRAW_U_1C_POS))
#define OSD_DRAW_H_REG_DRAW_Y_1C                    OSD_DRAW_H_REG_DRAW_Y_1C
#define OSD_DRAW_H_REG_DRAW_Y_1C_POS                (24U)
#define OSD_DRAW_H_REG_DRAW_Y_1C_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_Y_1C_MSK                (((1U << OSD_DRAW_H_REG_DRAW_Y_1C_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_1C_POS)
#define OSD_DRAW_H_REG_DRAW_Y_1C_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_Y_1C_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_1C_POS))

/* 0x9C : draw_partial_x_config1c */
#define OSD_DRAW_H_DRAW_PARTIAL_X_CONFIG1C_OFFSET (0x9C)
#define OSD_DRAW_H_REG_DRAW_X_MIN_1C              OSD_DRAW_H_REG_DRAW_X_MIN_1C
#define OSD_DRAW_H_REG_DRAW_X_MIN_1C_POS          (0U)
#define OSD_DRAW_H_REG_DRAW_X_MIN_1C_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_X_MIN_1C_MSK          (((1U << OSD_DRAW_H_REG_DRAW_X_MIN_1C_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MIN_1C_POS)
#define OSD_DRAW_H_REG_DRAW_X_MIN_1C_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_X_MIN_1C_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MIN_1C_POS))
#define OSD_DRAW_H_REG_DRAW_X_MAX_1C              OSD_DRAW_H_REG_DRAW_X_MAX_1C
#define OSD_DRAW_H_REG_DRAW_X_MAX_1C_POS          (16U)
#define OSD_DRAW_H_REG_DRAW_X_MAX_1C_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_X_MAX_1C_MSK          (((1U << OSD_DRAW_H_REG_DRAW_X_MAX_1C_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MAX_1C_POS)
#define OSD_DRAW_H_REG_DRAW_X_MAX_1C_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_X_MAX_1C_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MAX_1C_POS))

