RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/osd_draw_h_reg.h
/* 0xA0 : draw_partial_y_config1c */
#define OSD_DRAW_H_DRAW_PARTIAL_Y_CONFIG1C_OFFSET (0xA0)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_1C              OSD_DRAW_H_REG_DRAW_Y_MIN_1C
#define OSD_DRAW_H_REG_DRAW_Y_MIN_1C_POS          (0U)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_1C_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_1C_MSK          (((1U << OSD_DRAW_H_REG_DRAW_Y_MIN_1C_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MIN_1C_POS)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_1C_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_Y_MIN_1C_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MIN_1C_POS))
#define OSD_DRAW_H_REG_DRAW_Y_MAX_1C              OSD_DRAW_H_REG_DRAW_Y_MAX_1C
#define OSD_DRAW_H_REG_DRAW_Y_MAX_1C_POS          (16U)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_1C_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_1C_MSK          (((1U << OSD_DRAW_H_REG_DRAW_Y_MAX_1C_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MAX_1C_POS)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_1C_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_Y_MAX_1C_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MAX_1C_POS))

/* 0xA4 : draw_partial_yuv_config1d */
#define OSD_DRAW_H_DRAW_PARTIAL_YUV_CONFIG1D_OFFSET (0xA4)
#define OSD_DRAW_H_REG_DRAW_TH_1D                   OSD_DRAW_H_REG_DRAW_TH_1D
#define OSD_DRAW_H_REG_DRAW_TH_1D_POS               (0U)
#define OSD_DRAW_H_REG_DRAW_TH_1D_LEN               (8U)
#define OSD_DRAW_H_REG_DRAW_TH_1D_MSK               (((1U << OSD_DRAW_H_REG_DRAW_TH_1D_LEN) - 1) << OSD_DRAW_H_REG_DRAW_TH_1D_POS)
#define OSD_DRAW_H_REG_DRAW_TH_1D_UMSK              (~(((1U << OSD_DRAW_H_REG_DRAW_TH_1D_LEN) - 1) << OSD_DRAW_H_REG_DRAW_TH_1D_POS))
#define OSD_DRAW_H_REG_DRAW_V_1D                    OSD_DRAW_H_REG_DRAW_V_1D
#define OSD_DRAW_H_REG_DRAW_V_1D_POS                (8U)
#define OSD_DRAW_H_REG_DRAW_V_1D_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_V_1D_MSK                (((1U << OSD_DRAW_H_REG_DRAW_V_1D_LEN) - 1) << OSD_DRAW_H_REG_DRAW_V_1D_POS)
#define OSD_DRAW_H_REG_DRAW_V_1D_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_V_1D_LEN) - 1) << OSD_DRAW_H_REG_DRAW_V_1D_POS))
#define OSD_DRAW_H_REG_DRAW_U_1D                    OSD_DRAW_H_REG_DRAW_U_1D
#define OSD_DRAW_H_REG_DRAW_U_1D_POS                (16U)
#define OSD_DRAW_H_REG_DRAW_U_1D_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_U_1D_MSK                (((1U << OSD_DRAW_H_REG_DRAW_U_1D_LEN) - 1) << OSD_DRAW_H_REG_DRAW_U_1D_POS)
#define OSD_DRAW_H_REG_DRAW_U_1D_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_U_1D_LEN) - 1) << OSD_DRAW_H_REG_DRAW_U_1D_POS))
#define OSD_DRAW_H_REG_DRAW_Y_1D                    OSD_DRAW_H_REG_DRAW_Y_1D
#define OSD_DRAW_H_REG_DRAW_Y_1D_POS                (24U)
#define OSD_DRAW_H_REG_DRAW_Y_1D_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_Y_1D_MSK                (((1U << OSD_DRAW_H_REG_DRAW_Y_1D_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_1D_POS)
#define OSD_DRAW_H_REG_DRAW_Y_1D_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_Y_1D_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_1D_POS))

/* 0xA8 : draw_partial_x_config1d */
#define OSD_DRAW_H_DRAW_PARTIAL_X_CONFIG1D_OFFSET (0xA8)
#define OSD_DRAW_H_REG_DRAW_X_MIN_1D              OSD_DRAW_H_REG_DRAW_X_MIN_1D
#define OSD_DRAW_H_REG_DRAW_X_MIN_1D_POS          (0U)
#define OSD_DRAW_H_REG_DRAW_X_MIN_1D_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_X_MIN_1D_MSK          (((1U << OSD_DRAW_H_REG_DRAW_X_MIN_1D_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MIN_1D_POS)
#define OSD_DRAW_H_REG_DRAW_X_MIN_1D_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_X_MIN_1D_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MIN_1D_POS))
#define OSD_DRAW_H_REG_DRAW_X_MAX_1D              OSD_DRAW_H_REG_DRAW_X_MAX_1D
#define OSD_DRAW_H_REG_DRAW_X_MAX_1D_POS          (16U)
#define OSD_DRAW_H_REG_DRAW_X_MAX_1D_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_X_MAX_1D_MSK          (((1U << OSD_DRAW_H_REG_DRAW_X_MAX_1D_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MAX_1D_POS)
#define OSD_DRAW_H_REG_DRAW_X_MAX_1D_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_X_MAX_1D_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MAX_1D_POS))

/* 0xAC : draw_partial_y_config1d */
#define OSD_DRAW_H_DRAW_PARTIAL_Y_CONFIG1D_OFFSET (0xAC)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_1D              OSD_DRAW_H_REG_DRAW_Y_MIN_1D
#define OSD_DRAW_H_REG_DRAW_Y_MIN_1D_POS          (0U)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_1D_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_1D_MSK          (((1U << OSD_DRAW_H_REG_DRAW_Y_MIN_1D_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MIN_1D_POS)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_1D_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_Y_MIN_1D_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MIN_1D_POS))
#define OSD_DRAW_H_REG_DRAW_Y_MAX_1D              OSD_DRAW_H_REG_DRAW_Y_MAX_1D
#define OSD_DRAW_H_REG_DRAW_Y_MAX_1D_POS          (16U)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_1D_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_1D_MSK          (((1U << OSD_DRAW_H_REG_DRAW_Y_MAX_1D_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MAX_1D_POS)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_1D_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_Y_MAX_1D_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MAX_1D_POS))

/* 0xB0 : draw_partial_yuv_config1e */
#define OSD_DRAW_H_DRAW_PARTIAL_YUV_CONFIG1E_OFFSET (0xB0)
#define OSD_DRAW_H_REG_DRAW_TH_1E                   OSD_DRAW_H_REG_DRAW_TH_1E
#define OSD_DRAW_H_REG_DRAW_TH_1E_POS               (0U)
#define OSD_DRAW_H_REG_DRAW_TH_1E_LEN               (8U)
#define OSD_DRAW_H_REG_DRAW_TH_1E_MSK               (((1U << OSD_DRAW_H_REG_DRAW_TH_1E_LEN) - 1) << OSD_DRAW_H_REG_DRAW_TH_1E_POS)
#define OSD_DRAW_H_REG_DRAW_TH_1E_UMSK              (~(((1U << OSD_DRAW_H_REG_DRAW_TH_1E_LEN) - 1) << OSD_DRAW_H_REG_DRAW_TH_1E_POS))
#define OSD_DRAW_H_REG_DRAW_V_1E                    OSD_DRAW_H_REG_DRAW_V_1E
#define OSD_DRAW_H_REG_DRAW_V_1E_POS                (8U)
#define OSD_DRAW_H_REG_DRAW_V_1E_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_V_1E_MSK                (((1U << OSD_DRAW_H_REG_DRAW_V_1E_LEN) - 1) << OSD_DRAW_H_REG_DRAW_V_1E_POS)
#define OSD_DRAW_H_REG_DRAW_V_1E_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_V_1E_LEN) - 1) << OSD_DRAW_H_REG_DRAW_V_1E_POS))
#define OSD_DRAW_H_REG_DRAW_U_1E                    OSD_DRAW_H_REG_DRAW_U_1E
#define OSD_DRAW_H_REG_DRAW_U_1E_POS                (16U)
#define OSD_DRAW_H_REG_DRAW_U_1E_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_U_1E_MSK                (((1U << OSD_DRAW_H_REG_DRAW_U_1E_LEN) - 1) << OSD_DRAW_H_REG_DRAW_U_1E_POS)
#define OSD_DRAW_H_REG_DRAW_U_1E_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_U_1E_LEN) - 1) << OSD_DRAW_H_REG_DRAW_U_1E_POS))
#define OSD_DRAW_H_REG_DRAW_Y_1E                    OSD_DRAW_H_REG_DRAW_Y_1E
#define OSD_DRAW_H_REG_DRAW_Y_1E_POS                (24U)
#define OSD_DRAW_H_REG_DRAW_Y_1E_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_Y_1E_MSK                (((1U << OSD_DRAW_H_REG_DRAW_Y_1E_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_1E_POS)
#define OSD_DRAW_H_REG_DRAW_Y_1E_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_Y_1E_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_1E_POS))

/* 0xB4 : draw_partial_x_config1e */
#define OSD_DRAW_H_DRAW_PARTIAL_X_CONFIG1E_OFFSET (0xB4)
#define OSD_DRAW_H_REG_DRAW_X_MIN_1E              OSD_DRAW_H_REG_DRAW_X_MIN_1E
#define OSD_DRAW_H_REG_DRAW_X_MIN_1E_POS          (0U)
#define OSD_DRAW_H_REG_DRAW_X_MIN_1E_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_X_MIN_1E_MSK          (((1U << OSD_DRAW_H_REG_DRAW_X_MIN_1E_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MIN_1E_POS)
#define OSD_DRAW_H_REG_DRAW_X_MIN_1E_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_X_MIN_1E_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MIN_1E_POS))
#define OSD_DRAW_H_REG_DRAW_X_MAX_1E              OSD_DRAW_H_REG_DRAW_X_MAX_1E
#define OSD_DRAW_H_REG_DRAW_X_MAX_1E_POS          (16U)
#define OSD_DRAW_H_REG_DRAW_X_MAX_1E_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_X_MAX_1E_MSK          (((1U << OSD_DRAW_H_REG_DRAW_X_MAX_1E_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MAX_1E_POS)
#define OSD_DRAW_H_REG_DRAW_X_MAX_1E_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_X_MAX_1E_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MAX_1E_POS))

/* 0xB8 : draw_partial_y_config1e */
#define OSD_DRAW_H_DRAW_PARTIAL_Y_CONFIG1E_OFFSET (0xB8)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_1E              OSD_DRAW_H_REG_DRAW_Y_MIN_1E
#define OSD_DRAW_H_REG_DRAW_Y_MIN_1E_POS          (0U)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_1E_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_1E_MSK          (((1U << OSD_DRAW_H_REG_DRAW_Y_MIN_1E_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MIN_1E_POS)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_1E_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_Y_MIN_1E_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MIN_1E_POS))
#define OSD_DRAW_H_REG_DRAW_Y_MAX_1E              OSD_DRAW_H_REG_DRAW_Y_MAX_1E
#define OSD_DRAW_H_REG_DRAW_Y_MAX_1E_POS          (16U)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_1E_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_1E_MSK          (((1U << OSD_DRAW_H_REG_DRAW_Y_MAX_1E_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MAX_1E_POS)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_1E_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_Y_MAX_1E_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MAX_1E_POS))

/* 0xBC : draw_partial_yuv_config1f */
#define OSD_DRAW_H_DRAW_PARTIAL_YUV_CONFIG1F_OFFSET (0xBC)
#define OSD_DRAW_H_REG_DRAW_TH_1F                   OSD_DRAW_H_REG_DRAW_TH_1F
#define OSD_DRAW_H_REG_DRAW_TH_1F_POS               (0U)
#define OSD_DRAW_H_REG_DRAW_TH_1F_LEN               (8U)
#define OSD_DRAW_H_REG_DRAW_TH_1F_MSK               (((1U << OSD_DRAW_H_REG_DRAW_TH_1F_LEN) - 1) << OSD_DRAW_H_REG_DRAW_TH_1F_POS)
#define OSD_DRAW_H_REG_DRAW_TH_1F_UMSK              (~(((1U << OSD_DRAW_H_REG_DRAW_TH_1F_LEN) - 1) << OSD_DRAW_H_REG_DRAW_TH_1F_POS))
#define OSD_DRAW_H_REG_DRAW_V_1F                    OSD_DRAW_H_REG_DRAW_V_1F
#define OSD_DRAW_H_REG_DRAW_V_1F_POS                (8U)
#define OSD_DRAW_H_REG_DRAW_V_1F_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_V_1F_MSK                (((1U << OSD_DRAW_H_REG_DRAW_V_1F_LEN) - 1) << OSD_DRAW_H_REG_DRAW_V_1F_POS)
#define OSD_DRAW_H_REG_DRAW_V_1F_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_V_1F_LEN) - 1) << OSD_DRAW_H_REG_DRAW_V_1F_POS))
#define OSD_DRAW_H_REG_DRAW_U_1F                    OSD_DRAW_H_REG_DRAW_U_1F
#define OSD_DRAW_H_REG_DRAW_U_1F_POS                (16U)
#define OSD_DRAW_H_REG_DRAW_U_1F_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_U_1F_MSK                (((1U << OSD_DRAW_H_REG_DRAW_U_1F_LEN) - 1) << OSD_DRAW_H_REG_DRAW_U_1F_POS)
#define OSD_DRAW_H_REG_DRAW_U_1F_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_U_1F_LEN) - 1) << OSD_DRAW_H_REG_DRAW_U_1F_POS))
#define OSD_DRAW_H_REG_DRAW_Y_1F                    OSD_DRAW_H_REG_DRAW_Y_1F
#define OSD_DRAW_H_REG_DRAW_Y_1F_POS                (24U)
#define OSD_DRAW_H_REG_DRAW_Y_1F_LEN                (8U)
#define OSD_DRAW_H_REG_DRAW_Y_1F_MSK                (((1U << OSD_DRAW_H_REG_DRAW_Y_1F_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_1F_POS)
#define OSD_DRAW_H_REG_DRAW_Y_1F_UMSK               (~(((1U << OSD_DRAW_H_REG_DRAW_Y_1F_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_1F_POS))

/* 0xC0 : draw_partial_x_config1f */
#define OSD_DRAW_H_DRAW_PARTIAL_X_CONFIG1F_OFFSET (0xC0)
#define OSD_DRAW_H_REG_DRAW_X_MIN_1F              OSD_DRAW_H_REG_DRAW_X_MIN_1F
#define OSD_DRAW_H_REG_DRAW_X_MIN_1F_POS          (0U)
#define OSD_DRAW_H_REG_DRAW_X_MIN_1F_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_X_MIN_1F_MSK          (((1U << OSD_DRAW_H_REG_DRAW_X_MIN_1F_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MIN_1F_POS)
#define OSD_DRAW_H_REG_DRAW_X_MIN_1F_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_X_MIN_1F_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MIN_1F_POS))
#define OSD_DRAW_H_REG_DRAW_X_MAX_1F              OSD_DRAW_H_REG_DRAW_X_MAX_1F
#define OSD_DRAW_H_REG_DRAW_X_MAX_1F_POS          (16U)
#define OSD_DRAW_H_REG_DRAW_X_MAX_1F_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_X_MAX_1F_MSK          (((1U << OSD_DRAW_H_REG_DRAW_X_MAX_1F_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MAX_1F_POS)
#define OSD_DRAW_H_REG_DRAW_X_MAX_1F_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_X_MAX_1F_LEN) - 1) << OSD_DRAW_H_REG_DRAW_X_MAX_1F_POS))

