RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/osd_draw_h_reg.h
/* 0xC4 : draw_partial_y_config1f */
#define OSD_DRAW_H_DRAW_PARTIAL_Y_CONFIG1F_OFFSET (0xC4)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_1F              OSD_DRAW_H_REG_DRAW_Y_MIN_1F
#define OSD_DRAW_H_REG_DRAW_Y_MIN_1F_POS          (0U)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_1F_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_1F_MSK          (((1U << OSD_DRAW_H_REG_DRAW_Y_MIN_1F_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MIN_1F_POS)
#define OSD_DRAW_H_REG_DRAW_Y_MIN_1F_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_Y_MIN_1F_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MIN_1F_POS))
#define OSD_DRAW_H_REG_DRAW_Y_MAX_1F              OSD_DRAW_H_REG_DRAW_Y_MAX_1F
#define OSD_DRAW_H_REG_DRAW_Y_MAX_1F_POS          (16U)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_1F_LEN          (11U)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_1F_MSK          (((1U << OSD_DRAW_H_REG_DRAW_Y_MAX_1F_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MAX_1F_POS)
#define OSD_DRAW_H_REG_DRAW_Y_MAX_1F_UMSK         (~(((1U << OSD_DRAW_H_REG_DRAW_Y_MAX_1F_LEN) - 1) << OSD_DRAW_H_REG_DRAW_Y_MAX_1F_POS))

struct osd_draw_h_reg {
    /* 0x0  reserved */
    uint8_t RESERVED0x0[4];

    /* 0x4 : draw_partial_config */
    union {
        struct {
            uint32_t reg_draw_en_h   : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reg_draw_type_h : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_config;

    /* 0x8 : draw_partial_yuv_config10 */
    union {
        struct {
            uint32_t reg_draw_th_10 : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_draw_v_10  : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_draw_u_10  : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_draw_y_10  : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_yuv_config10;

    /* 0xC : draw_partial_x_config10 */
    union {
        struct {
            uint32_t reg_draw_x_min_10 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_x_max_10 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_x_config10;

    /* 0x10 : draw_partial_y_config10 */
    union {
        struct {
            uint32_t reg_draw_y_min_10 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_y_max_10 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_y_config10;

    /* 0x14 : draw_partial_yuv_config11 */
    union {
        struct {
            uint32_t reg_draw_th_11 : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_draw_v_11  : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_draw_u_11  : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_draw_y_11  : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_yuv_config11;

    /* 0x18 : draw_partial_x_config11 */
    union {
        struct {
            uint32_t reg_draw_x_min_11 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_x_max_11 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_x_config11;

    /* 0x1C : draw_partial_y_config11 */
    union {
        struct {
            uint32_t reg_draw_y_min_11 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_y_max_11 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_y_config11;

    /* 0x20 : draw_partial_yuv_config12 */
    union {
        struct {
            uint32_t reg_draw_th_12 : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_draw_v_12  : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_draw_u_12  : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_draw_y_12  : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_yuv_config12;

    /* 0x24 : draw_partial_x_config12 */
    union {
        struct {
            uint32_t reg_draw_x_min_12 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_x_max_12 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_x_config12;

    /* 0x28 : draw_partial_y_config12 */
    union {
        struct {
            uint32_t reg_draw_y_min_12 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_y_max_12 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_y_config12;

    /* 0x2C : draw_partial_yuv_config13 */
    union {
        struct {
            uint32_t reg_draw_th_13 : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_draw_v_13  : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_draw_u_13  : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_draw_y_13  : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_yuv_config13;

    /* 0x30 : draw_partial_x_config13 */
    union {
        struct {
            uint32_t reg_draw_x_min_13 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_x_max_13 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_x_config13;

    /* 0x34 : draw_partial_y_config13 */
    union {
        struct {
            uint32_t reg_draw_y_min_13 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_y_max_13 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_y_config13;

    /* 0x38 : draw_partial_yuv_config14 */
    union {
        struct {
            uint32_t reg_draw_th_14 : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_draw_v_14  : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_draw_u_14  : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_draw_y_14  : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_yuv_config14;

