RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/osd_draw_h_reg.h
    /* 0x3C : draw_partial_x_config14 */
    union {
        struct {
            uint32_t reg_draw_x_min_14 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_x_max_14 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_x_config14;

    /* 0x40 : draw_partial_y_config14 */
    union {
        struct {
            uint32_t reg_draw_y_min_14 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_y_max_14 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_y_config14;

    /* 0x44 : draw_partial_yuv_config15 */
    union {
        struct {
            uint32_t reg_draw_th_15 : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_draw_v_15  : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_draw_u_15  : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_draw_y_15  : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_yuv_config15;

    /* 0x48 : draw_partial_x_config15 */
    union {
        struct {
            uint32_t reg_draw_x_min_15 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_x_max_15 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_x_config15;

    /* 0x4C : draw_partial_y_config15 */
    union {
        struct {
            uint32_t reg_draw_y_min_15 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_y_max_15 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_y_config15;

    /* 0x50 : draw_partial_yuv_config16 */
    union {
        struct {
            uint32_t reg_draw_th_16 : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_draw_v_16  : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_draw_u_16  : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_draw_y_16  : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_yuv_config16;

    /* 0x54 : draw_partial_x_config16 */
    union {
        struct {
            uint32_t reg_draw_x_min_16 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_x_max_16 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_x_config16;

    /* 0x58 : draw_partial_y_config16 */
    union {
        struct {
            uint32_t reg_draw_y_min_16 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_y_max_16 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_y_config16;

    /* 0x5C : draw_partial_yuv_config17 */
    union {
        struct {
            uint32_t reg_draw_th_17 : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_draw_v_17  : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_draw_u_17  : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_draw_y_17  : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_yuv_config17;

    /* 0x60 : draw_partial_x_config17 */
    union {
        struct {
            uint32_t reg_draw_x_min_17 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_x_max_17 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_x_config17;

    /* 0x64 : draw_partial_y_config17 */
    union {
        struct {
            uint32_t reg_draw_y_min_17 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_y_max_17 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_y_config17;

    /* 0x68 : draw_partial_yuv_config18 */
    union {
        struct {
            uint32_t reg_draw_th_18 : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_draw_v_18  : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_draw_u_18  : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_draw_y_18  : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_yuv_config18;

    /* 0x6C : draw_partial_x_config18 */
    union {
        struct {
            uint32_t reg_draw_x_min_18 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_x_max_18 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_x_config18;

    /* 0x70 : draw_partial_y_config18 */
    union {
        struct {
            uint32_t reg_draw_y_min_18 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_y_max_18 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_y_config18;

    /* 0x74 : draw_partial_yuv_config19 */
    union {
        struct {
            uint32_t reg_draw_th_19 : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_draw_v_19  : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_draw_u_19  : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_draw_y_19  : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_yuv_config19;

    /* 0x78 : draw_partial_x_config19 */
    union {
        struct {
            uint32_t reg_draw_x_min_19 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_x_max_19 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_x_config19;

