RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/osd_draw_h_reg.h
    /* 0x7C : draw_partial_y_config19 */
    union {
        struct {
            uint32_t reg_draw_y_min_19 : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_y_max_19 : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_y_config19;

    /* 0x80 : draw_partial_yuv_config1a */
    union {
        struct {
            uint32_t reg_draw_th_1a : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_draw_v_1a  : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_draw_u_1a  : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_draw_y_1a  : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_yuv_config1a;

    /* 0x84 : draw_partial_x_config1a */
    union {
        struct {
            uint32_t reg_draw_x_min_1a : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_x_max_1a : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_x_config1a;

    /* 0x88 : draw_partial_y_config1a */
    union {
        struct {
            uint32_t reg_draw_y_min_1a : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_y_max_1a : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_y_config1a;

    /* 0x8C : draw_partial_yuv_config1b */
    union {
        struct {
            uint32_t reg_draw_th_1b : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_draw_v_1b  : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_draw_u_1b  : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_draw_y_1b  : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_yuv_config1b;

    /* 0x90 : draw_partial_x_config1b */
    union {
        struct {
            uint32_t reg_draw_x_min_1b : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_x_max_1b : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_x_config1b;

    /* 0x94 : draw_partial_y_config1b */
    union {
        struct {
            uint32_t reg_draw_y_min_1b : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_y_max_1b : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_y_config1b;

    /* 0x98 : draw_partial_yuv_config1c */
    union {
        struct {
            uint32_t reg_draw_th_1c : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_draw_v_1c  : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_draw_u_1c  : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_draw_y_1c  : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_yuv_config1c;

    /* 0x9C : draw_partial_x_config1c */
    union {
        struct {
            uint32_t reg_draw_x_min_1c : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_x_max_1c : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_x_config1c;

    /* 0xA0 : draw_partial_y_config1c */
    union {
        struct {
            uint32_t reg_draw_y_min_1c : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_y_max_1c : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_y_config1c;

    /* 0xA4 : draw_partial_yuv_config1d */
    union {
        struct {
            uint32_t reg_draw_th_1d : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_draw_v_1d  : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_draw_u_1d  : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_draw_y_1d  : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_yuv_config1d;

    /* 0xA8 : draw_partial_x_config1d */
    union {
        struct {
            uint32_t reg_draw_x_min_1d : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_x_max_1d : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_x_config1d;

    /* 0xAC : draw_partial_y_config1d */
    union {
        struct {
            uint32_t reg_draw_y_min_1d : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_y_max_1d : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_y_config1d;

    /* 0xB0 : draw_partial_yuv_config1e */
    union {
        struct {
            uint32_t reg_draw_th_1e : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_draw_v_1e  : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_draw_u_1e  : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_draw_y_1e  : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_yuv_config1e;

    /* 0xB4 : draw_partial_x_config1e */
    union {
        struct {
            uint32_t reg_draw_x_min_1e : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_x_max_1e : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_x_config1e;

    /* 0xB8 : draw_partial_y_config1e */
    union {
        struct {
            uint32_t reg_draw_y_min_1e : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_y_max_1e : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_y_config1e;

    /* 0xBC : draw_partial_yuv_config1f */
    union {
        struct {
            uint32_t reg_draw_th_1f : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_draw_v_1f  : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_draw_u_1f  : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_draw_y_1f  : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_yuv_config1f;

    /* 0xC0 : draw_partial_x_config1f */
    union {
        struct {
            uint32_t reg_draw_x_min_1f : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_x_max_1f : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_x_config1f;

    /* 0xC4 : draw_partial_y_config1f */
    union {
        struct {
            uint32_t reg_draw_y_min_1f : 11; /* [10: 0],        r/w,        0x0 */
            uint32_t reserved_11_15    : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t reg_draw_y_max_1f : 11; /* [26:16],        r/w,        0x0 */
            uint32_t reserved_27_31    : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } draw_partial_y_config1f;
};

typedef volatile struct osd_draw_h_reg osd_draw_h_reg_t;

#endif /* __OSD_DRAW_H_REG_H__ */
